# OnRestoreDefaultsAction Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TabbedDialogExtension..::..OnRestoreDefaultsAction Property
TabbedDialogExtension Class See Also
---
The restore defaults handler.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public TabbedDialogAction OnRestoreDefaultsAction { get; set; }
```

Visual Basic
---
```text
Public Property OnRestoreDefaultsAction As TabbedDialogAction
	Get
	Set
```

Visual C++
---
```text
public:
property TabbedDialogAction^ OnRestoreDefaultsAction {
	TabbedDialogAction^ get ();
	void set (TabbedDialogAction^ value);
}
```

# Remarks
This handler will be invoked when the "Restore Defaults" button in Revit options dialog is clicked and the handler should apply only to options set on this page. There is no "Restore Defaults" button in Revit options dialog if this property was set to nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace